# ViewNavigationToolSettings Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewNavigationToolSettings Class
Members See Also
---
Represents the settings contained in the document associated to the View Navigation tools (such as the View Cube).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class ViewNavigationToolSettings : Element
```

Visual Basic
---
```text
Public Class ViewNavigationToolSettings _
	Inherits Element
```

Visual C++
---
```text
public ref class ViewNavigationToolSettings : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ViewNavigationToolSettings
# See Also
ViewNavigationToolSettings Members
Autodesk.Revit.DB Namespace